Now We are going to run some SQL queries here in the notebook. These queries also work on SQLiteStudio.

Ahora vamos a ejecutar acá en el Notebook algunas consultas de SQL. Estas consultas también funcionan en el SQLiteStudio.

### Libraries and read files

In [1]:
import pandas as pd
import numpy as np
from pandasql import sqldf

In [2]:
# Lectura de archivos
courses = pd.read_csv("C:/Users/usuario/%Python/sql-practice/courses.csv")
instructors = pd.read_csv("C:/Users/usuario/%Python/sql-practice/instructors.csv")
schools = pd.read_csv("C:/Users/usuario/%Python/sql-practice/schools.csv")
users = pd.read_csv("C:/Users/usuario/%Python/sql-practice/users.csv")
submissions = pd.read_csv("C:/Users/usuario/%Python/sql-practice/submissions.csv")

In [3]:
courses.head()

,id,course_name,date_created,school_id,public_course,category,sync_date
0,6900,biology569,2019-11-27 00:00:00,100.0,1,6,2019-11-28 00:00:00
1,6901,biology1049,2020-08-06 00:00:00,261.0,0,8,2020-08-07 00:00:00
2,6902,biology725,2020-03-29 00:00:00,322.0,0,6,2020-03-30 00:00:00
3,6903,biology427,2020-08-06 00:00:00,54.0,0,7,2020-08-07 00:00:00
4,6904,biology1139,2019-03-14 00:00:00,218.0,0,8,2019-03-15 00:00:00

In [4]:
instructors.head()

,id,school_id,course_id,email,date_created,admin,category,external_id,sync_date
0,6410,757.0,41,64105164@email.com,2019-07-20 00:00:00,0,3,student_8472,2019-07-21 00:00:00
1,3515,549.0,10,35153981@email.com,2019-10-25 00:00:00,0,8,student_6471,2019-10-26 00:00:00
2,2866,219.0,55,28662212@email.com,2020-04-19 00:00:00,0,1,student_4156,2020-04-20 00:00:00
3,4762,727.0,14,47626955@email.com,2019-12-08 00:00:00,1,0,student_9495,2019-12-09 00:00:00
4,865,465.0,25,8655420@email.com,2020-03-16 00:00:00,0,8,student_3685,2020-03-17 00:00:00

In [5]:
schools.head()

,id,school_name,online_school,category,date_created,lottery,country,sync_date
0,759.0,Universtity of725,0,10,2019-09-07 00:00:00,11,US,2019-09-08 00:00:00
1,483.0,Universtity of1398,1,8,2019-07-19 00:00:00,19,US,2019-07-20 00:00:00
2,433.0,Universtity of693,1,10,2019-07-01 00:00:00,5,US,2019-07-02 00:00:00
3,728.0,Universtity of1104,1,9,2019-04-02 00:00:00,3,US,2019-04-03 00:00:00
4,451.0,Universtity of498,1,4,2019-02-17 00:00:00,10,US,2019-02-18 00:00:00

In [6]:
users.head()

,id,email,external_id,date_created,admin,category,sync_date
0,19077,190777503@email.com,student_8644,2019-01-07 00:00:00,0,8,2019-01-08 00:00:00
1,8459,84599050@email.com,student_1230,2020-08-14 00:00:00,1,0,2020-08-15 00:00:00
2,457,4574423@email.com,student_5666,2019-09-19 00:00:00,1,6,2019-09-20 00:00:00
3,77,773297@email.com,student_7844,2019-10-31 00:00:00,0,9,2019-11-01 00:00:00
4,7125,71258995@email.com,student_8925,2019-06-22 00:00:00,0,8,2019-06-23 00:00:00

In [7]:
submissions.head()

,submission_id,user_id,course_id,assignment_submission_id,school_id,created_automatically,submission_date,deleted,active,sync_date,course_count
0,22901,25781,27,209380,839.0,2,2019-10-24 00:00:00,0,0,2019-10-25 00:00:00,839_27
1,434067,21533,59,18829,79.0,1,2019-10-22 00:00:00,0,0,2019-10-23 00:00:00,79_59
2,330025,18278,1,13280,107.0,0,2019-03-30 00:00:00,0,1,2019-03-31 00:00:00,107_1
3,444610,24854,38,231269,648.0,1,2021-12-03 00:00:00,0,1,2021-12-04 00:00:00,648_38
4,297178,14471,60,37119,51.0,2,2019-11-23 00:00:00,0,1,2019-11-24 00:00:00,51_60

In [8]:
submissions.shape

(1000000, 11)

### Basic queries

In [9]:
print(sqldf('''
SELECT country 
FROM schools 
LIMIT 5
'''))

  country
0      US
1      US
2      US
3      US
4      US

In [10]:
print(sqldf('''
SELECT DISTINCT country 
FROM schools'''))

    country
0        US
1        UK
2    Mexico
3     Italy
4  Thailand
5     China
6    Canada

In [11]:
print(sqldf('''SELECT *
                 FROM schools 
                WHERE country = 'US'  AND online_school = '1'
                  '''))

       id         school_name  online_school  category         date_created  \
0   483.0  Universtity of1398              1         8  2019-07-19 00:00:00
1   433.0   Universtity of693              1        10  2019-07-01 00:00:00
2   728.0  Universtity of1104              1         9  2019-04-02 00:00:00
3   451.0   Universtity of498              1         4  2019-02-17 00:00:00
4   777.0   Universtity of157              1         3  2019-06-19 00:00:00
..    ...                 ...            ...       ...                  ...
66  345.0   Universtity of344              1         0  2019-02-26 00:00:00
67  786.0  Universtity of1255              1         0  2019-07-02 00:00:00
68  539.0   Universtity of429              1         4  2019-08-23 00:00:00
69  211.0   Universtity of508              1        10  2019-01-14 00:00:00
70  188.0   Universtity of857              1         0  2019-02-19 00:00:00

    lottery country            sync_date
0        19      US  2019-07-20 00:00:00
1         5      US  2019-07-02 00:00:00
2         3      US  2019-04-03 00:00:00
3        10      US  2019-02-18 00:00:00
4         4      US  2019-06-20 00:00:00
..      ...     ...                  ...
66       29      US  2019-02-27 00:00:00
67       14      US  2019-07-03 00:00:00
68        4      US  2019-08-24 00:00:00
69       17      US  2019-01-15 00:00:00
70        4      US  2019-02-20 00:00:00

[71 rows x 8 columns]

In [12]:
print(sqldf('''
SELECT country, count(id)
FROM schools 
GROUP BY country
ORDER BY count(id) DESC
'''))

    country  count(id)
0     Italy        139
1        US        133
2     China        131
3        UK        126
4    Mexico        119
5    Canada        118
6  Thailand         79

In [13]:
# Min and max of submissions

print(sqldf('''
SELECT min(submission_date),max(submission_date)
FROM submissions
'''))

  min(submission_date) max(submission_date)
0  2019-01-01 00:00:00  2022-11-01 00:00:00

### Interesting queries

In [14]:
print(sqldf('''
SELECT school_name,school_id, count(submission_id)
FROM submissions
INNER JOIN schools on schools.id = submissions.school_id
GROUP BY school_id
ORDER BY count(submission_id) DESC
LIMIT 10
'''))

          school_name  school_id  count(submission_id)
0   Universtity of981      752.0                  1317
1    Universtity of18      271.0                  1301
2   Universtity of942      732.0                  1291
3   Universtity of161      631.0                  1286
4  Universtity of1176      591.0                  1278
5   Universtity of287      456.0                  1271
6   Universtity of429        7.0                  1271
7  Universtity of1172      484.0                  1267
8    Universtity of54      254.0                  1267
9  Universtity of1237      229.0                  1266

In [15]:
print(sqldf('''
SELECT country, school_name,school_id, count(submission_id)
FROM submissions
INNER JOIN schools on schools.id = submissions.school_id
GROUP BY school_id
ORDER BY count(submission_id) DESC
LIMIT 10
'''))

  country         school_name  school_id  count(submission_id)
0  Mexico   Universtity of981      752.0                  1317
1  Mexico    Universtity of18      271.0                  1301
2   China   Universtity of942      732.0                  1291
3      UK   Universtity of161      631.0                  1286
4  Canada  Universtity of1176      591.0                  1278
5      US   Universtity of287      456.0                  1271
6      US   Universtity of429        7.0                  1271
7      US  Universtity of1172      484.0                  1267
8      US    Universtity of54      254.0                  1267
9      US  Universtity of1237      229.0                  1266

In [16]:
print(sqldf('''
SELECT country, school_name, count(submission_id)
FROM submissions
INNER JOIN schools on schools.id = submissions.school_id
GROUP BY school_id
ORDER BY count(submission_id) DESC
LIMIT 10
'''))

  country         school_name  count(submission_id)
0  Mexico   Universtity of981                  1317
1  Mexico    Universtity of18                  1301
2   China   Universtity of942                  1291
3      UK   Universtity of161                  1286
4  Canada  Universtity of1176                  1278
5      US   Universtity of287                  1271
6      US   Universtity of429                  1271
7      US  Universtity of1172                  1267
8      US    Universtity of54                  1267
9      US  Universtity of1237                  1266

In [18]:
print(sqldf('''
WITH OD_DOS AS (

SELECT country,online_school, count(id) AS Total_schools
FROM schools
WHERE country IN ('Thailand','Canada','Mexico')
GROUP BY country,online_school
--ORDER BY country,count(id) DESC
UNION
SELECT country,replace(replace(online_school,1,'Subtotal'),0,'Subtotal') AS online_school, count(id)
FROM schools
WHERE country IN ('Thailand','Canada','Mexico')
GROUP BY country
ORDER BY country,online_school ASC,count(id) DESC
)
SELECT *
FROM OD_DOS
'''))

    country online_school  Total_schools
0    Canada             0             47
1    Canada             1             71
2    Canada      Subtotal            118
3    Mexico             0             58
4    Mexico             1             61
5    Mexico      Subtotal            119
6  Thailand             0             52
7  Thailand             1             27
8  Thailand      Subtotal             79

In [19]:
print(sqldf('''
WITH OD_DOS AS (
SELECT country,online_school, count(id) AS Total_schools
FROM schools
--WHERE country IN ('Thailand','Canada','Mexico')
GROUP BY country,online_school
--ORDER BY country,count(id) DESC
UNION
SELECT country,replace(replace(online_school,1,'Subtotal'),0,'Subtotal') AS online_school, count(id)
FROM schools
--WHERE country IN ('Thailand','Canada','Mexico')
GROUP BY country
ORDER BY country,online_school ASC,count(id) DESC
)
SELECT *
FROM OD_DOS
'''))

     country online_school  Total_schools
0     Canada             0             47
1     Canada             1             71
2     Canada      Subtotal            118
3      China             0             62
4      China             1             69
5      China      Subtotal            131
6      Italy             0             69
7      Italy             1             70
8      Italy      Subtotal            139
9     Mexico             0             58
10    Mexico             1             61
11    Mexico      Subtotal            119
12  Thailand             0             52
13  Thailand             1             27
14  Thailand      Subtotal             79
15        UK             0             62
16        UK             1             64
17        UK      Subtotal            126
18        US             0             62
19        US             1             71
20        US      Subtotal            133

Note: since RollUp does not work in SQLite, we use replace for subtotals.

Nota: como en SQLite no hay RollUp, toca replace para subtotales.

In [20]:
print(sqldf('''
WITH OD_DOS AS (
SELECT country,online_school, count(id) AS Total_schools
FROM schools
GROUP BY country,online_school
UNION
SELECT country,replace(replace(online_school,1,'Subtotal'),0,'Subtotal') AS online_school, count(id)
FROM schools
GROUP BY country
)
SELECT *
FROM OD_DOS
UNION
SELECT replace(country,'US',' Total') AS country,replace(online_school,0,'') AS online_school, count(id)
FROM schools
ORDER BY country DESC,Total_schools ASC,online_school
'''))

     country online_school  Total_schools
0         US             0             62
1         US             1             71
2         US      Subtotal            133
3         UK             0             62
4         UK             1             64
5         UK      Subtotal            126
6   Thailand             1             27
7   Thailand             0             52
8   Thailand      Subtotal             79
9     Mexico             0             58
10    Mexico             1             61
11    Mexico      Subtotal            119
12     Italy             0             69
13     Italy             1             70
14     Italy      Subtotal            139
15     China             0             62
16     China             1             69
17     China      Subtotal            131
18    Canada             0             47
19    Canada             1             71
20    Canada      Subtotal            118
21     Total                          845

In [21]:
print(sqldf('''
SELECT school_id,SUBSTRING(submission_date, 1, 4)||SUBSTRING(submission_date, 6, 2) AS submission_month,count(submission_id)
FROM submissions
GROUP BY school_id,submission_month
ORDER BY school_id DESC
LIMIT 10
'''))

   school_id submission_month  count(submission_id)
0      850.0           201901                    23
1      850.0           201902                    27
2      850.0           201903                    22
3      850.0           201904                    32
4      850.0           201905                    32
5      850.0           201906                    28
6      850.0           201907                    17
7      850.0           201908                    36
8      850.0           201909                    19
9      850.0           201910                    28

Note: SQLite lacks a built-in PIVOT function...

Nota: a SQLite le hace falta una built-in function como PIVOT...

In [23]:
print(sqldf('''
WITH SUBS_PRIMERA AS (
SELECT * FROM (
SELECT schools.school_name AS school_name, school_id,SUBSTRING(submission_date, 1, 4)||SUBSTRING(submission_date, 6, 2) AS submission_month,count(submission_id) AS Subs
FROM submissions
LEFT JOIN schools ON schools.id = submissions.school_id
GROUP BY school_name,submission_month
--ORDER BY school_id DESC
))

SELECT school_name,
MAX(CASE WHEN submission_month = '202101' THEN Subs ELSE 0 END) AS "202101",
MAX(CASE WHEN submission_month = '202102' THEN Subs END) AS "202102",
MAX(CASE WHEN submission_month = '202103' THEN Subs END) AS "202103",
MAX(CASE WHEN submission_month = '202104' THEN Subs END) AS "202104",
MAX(CASE WHEN submission_month = '202105' THEN Subs END) AS "202105"
FROM SUBS_PRIMERA
GROUP BY school_name
'''))

            school_name  202101  202102  202103  202104  202105
0                  None      23      20      33      24      25
1    Universtity of1000      65      71      75      94      72
2    Universtity of1001      21      26      25      25      28
3    Universtity of1002      32      35      29      23      18
4    Universtity of1005      54      39      55      52      58
..                  ...     ...     ...     ...     ...     ...
638   Universtity of987      24      23      25      26      30
639   Universtity of990      46      59      49      59      67
640   Universtity of994      29      25      30      24      29
641   Universtity of996      54      55      53      51      48
642   Universtity of999      59      61      82      90      68

[643 rows x 6 columns]

### Bonus: run the following queries only in SQLiteStudio

### Bonus: ejecutar la siguientes consultas solo en SQLiteStudio

In [ ]:
print(sqldf('''
WITH submissions2 AS (
SELECT 
submission_id,user_id,course_id,school_id,STRFTIME("%Y%m", submissions.submission_date_2) AS submission_YearMonth, STRFTIME("%Y", submissions.submission_date_2) AS submission_Year,
STRFTIME("%m", submissions.submission_date_2) AS submission_Month,
schools.school_name AS school_name, course_id||'-'||school_id AS course_id__school_id
FROM submissions
LEFT JOIN 'schools' ON 'schools'.id = submissions.school_id
),

courses2 AS (
SELECT id||'-'||school_id AS course_id__school_id,id,course_name,school_id
FROM courses),

instructors2 AS (
SELECT course_id||'-'||school_id AS course_id__school_id,instructors_id
FROM instructors)

--CREATE TABLE submissions3 AS
SELECT submission_id,user_id,course_id,submissions2.school_id AS school_id,submission_YearMonth,submission_Year,submission_Month,school_name,submissions2.course_id__school_id,courses2.course_name AS course_name, instructors2.instructors_id AS instructors_id
from submissions2
LEFT JOIN 'courses2' ON courses2.course_id__school_id = submissions2.course_id__school_id
LEFT JOIN 'instructors2' ON instructors2.course_id__school_id = submissions2.course_id__school_id
'''))

In [ ]:
print(sqldf('''SELECT school_id,
--STRFTIME("%Y%m", submissions.submission_date) AS submission_YearMonth,
count(submission_id)
--submission_id
--submission_id,user_id,course_id,school_id,STRFTIME("%Y%m", submissions.submission_date_2) AS submission_YearMonth, STRFTIME("%Y", submissions.submission_date_2) AS submission_Year,
--STRFTIME("%m", submissions.submission_date_2) AS submission_Month,
--schools.school_name AS school_name, course_id||'-'||school_id AS course_id__school_id
FROM submissions
GROUP BY school_id
ORDER BY count(submission_id) DESC
LIMIT 10
'''))

### Bonus 2: example of create table

### Bonus 2: ejemplo de creación de tabla

In [ ]:
# To begin work on the .db file it is required to connect to the database

# Para empezar a trabajar sobre el archivo .db se requiere conectarse a la base de datos
connection = sqlite3.connect('C:/Users/usuario/%Python/sql-practice/db_a.db')

In [ ]:
# Cursor is a database object that allows to perform operations in a dataset

# Cursor es un objeto que permite ejecutar operaciones en un dataset
cursor = connection.cursor()

In [ ]:
# It is always a good practice to use delete if exists

# Siempre se recomienda eliminarla si extiste

cursor.execute('DROP TABLE IF EXISTS z_submissions_users')

In [ ]:
# Create table

# Crear la tabla

cursor.execute('''CREATE TABLE z_submissions_users AS WITH temp_2 AS (
SELECT *,
  STRFTIME("%Y%m", submissions.submission_date_2) AS submission_YearMonth,
  DateDimension.YearNumber AS submission_Year,
  DateDimension.MonthNumber AS submission_Month,
  COUNT(DISTINCT user_id) AS CANT_user
  --COUNT(assignment_submission_id) AS count
FROM 'submissions'
--LEFT JOIN 'schools' ON 'schools'.id = 'submissions'.school_id
--LEFT JOIN 'users' ON 'users'.id = 'submissions'.user_id
LEFT JOIN 'DateDimension' ON 'DateDimension'.CalendarDateInterval = 'submissions'.submission_date
GROUP BY
  STRFTIME("%Y%m", submissions.submission_date_2),submission_Year,submission_Month
ORDER BY submission_YearMonth
)
SELECT submission_YearMonth,submission_Month,submission_Year,CANT_user
FROM temp_2
ORDER BY submission_YearMonth;''')

In [ ]:
# This method (commit) is used to confirm the changes made to the database

# El método commit se usa para confirmar los cambios hechos en la base de datos
connection.commit()

In [ ]:
# This method (close) ends the connection. It should be executed only at the end of the coding.

# El método Close termina la conexión. Solo debe ser ejecutado al finalizar el código.
connection.close()